In [16]:
import pandas as pd
import numpy as np

In [17]:
people = {
    "first": ["Rifat", "Masum", "Sayem", 'Chris', np.nan, None, 'NA'], 
    "last": ["Muhtasim", "Abdullah", "Ahmed", 'Schafer', np.nan, np.nan, 'Missing'], 
    "email": ["rifatmuhtasim@tavlav.com", "abdullah_masum@gmail.com", "sayem_ahmed@email.com", None, np.nan, 'Anonymous@email.com', "NA"],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [18]:
df = pd.DataFrame(people)

df.replace("NA", np.nan, inplace=True)
df.replace("Missing", np.nan, inplace=True)

df

   first      last                     email   age
0  Rifat  Muhtasim  rifatmuhtasim@tavlav.com    33
1  Masum  Abdullah  abdullah_masum@gmail.com    55
2  Sayem     Ahmed     sayem_ahmed@email.com    63
3  Chris   Schafer                      None    36
4    NaN       NaN                       NaN  None
5   None       NaN       Anonymous@email.com  None
6    NaN       NaN                       NaN   NaN

In [21]:
## Remove Rows that have missing value
df.dropna()

## Drop the Row if there are no email address
df.dropna(axis="index", how="all", subset=["email"])

   first      last                     email   age
0  Rifat  Muhtasim  rifatmuhtasim@tavlav.com    33
1  Masum  Abdullah  abdullah_masum@gmail.com    55
2  Sayem     Ahmed     sayem_ahmed@email.com    63
5   None       NaN       Anonymous@email.com  None

In [22]:
## Check the NA value in the dataset
df.isna()

## Fil

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True